In [1]:
# 라이브러리 가져오기
#  문서마다 메모리 공유하지 않는 것 같음
library(dplyr)

Warning message:
"package 'dplyr' was built under R version 3.6.3"
Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

### select(변수명) : 변수명 추출/분할

In [2]:
exam <- read.csv("./files/exam.csv", fileEncoding='utf-8', encoding='utf-8')

In [12]:
# 데이터 3건 출력
exam  %>% head(3)
head(exam, 3)

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60
3 3  1     45   86      78

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60
3 3  1     45   86      78

In [13]:
# select()의 사용
exam  %>% select(math)  %>%  head(3)
# math
# 50
# 60
# 45

  math
1 50
2 60
3 45

In [14]:
# select() -> 여러 변수 선택
exam  %>% select(class, math, english)  %>% head(3)
# class	math	english
# 1	50	98
# 1	60	97
# 1	45	86

  class math english
1 1     50   98
2 1     60   97
3 1     45   86

In [15]:
# select() -> 변수 제외
exam  %>% select(-class, -math, -english)  %>% head(3)
# id	science
# 1	50
# 2	60
# 3	78

  id science
1 1  50
2 2  60
3 3  78

In [16]:
# 2반에 math 성적 출력
exam  %>%  filter(class==2)  %>%  select(math)
# math
# 25
# 50
# 80
# 90

  math
1 25
2 50
3 80
4 90

In [ ]:
# [실습] mpg 데이터 분석
# 1. mpg 데이터중 class(자동차 종류), cty(도시 연비) 
# 변수를 추출해 새로운 데이터를 구성할것.
# 새로운 데이터의 일부를 출력할 것.

In [3]:
mpg <-as.data.frame(ggplot2::mpg)
class(mpg)
str(mpg)

[1] "data.frame"

'data.frame':	234 obs. of  11 variables:
 $ manufacturer: chr  "audi" "audi" "audi" "audi" ...
 $ model       : chr  "a4" "a4" "a4" "a4" ...
 $ displ       : num  1.8 1.8 2 2 2.8 2.8 3.1 1.8 1.8 2 ...
 $ year        : int  1999 1999 2008 2008 1999 1999 2008 1999 1999 2008 ...
 $ cyl         : int  4 4 4 4 6 6 6 4 4 4 ...
 $ trans       : chr  "auto(l5)" "manual(m5)" "manual(m6)" "auto(av)" ...
 $ drv         : chr  "f" "f" "f" "f" ...
 $ cty         : int  18 21 20 21 16 18 18 18 16 20 ...
 $ hwy         : int  29 29 31 30 26 26 27 26 25 28 ...
 $ fl          : chr  "p" "p" "p" "p" ...
 $ class       : chr  "compact" "compact" "compact" "compact" ...

In [33]:
mpg2 <- mpg  %>% select(class, cty)
mpg2  %>% head(3)
# class	cty
# compact	18
# compact	21
# compact	20

mpg2  %>% tail(2)
# class	cty
# 233	midsize	18
# 234	midsize	17

  class   cty
1 compact 18
2 compact 21
3 compact 20

    class   cty
233 midsize 18
234 midsize 17

In [ ]:
# 2. class(자동차 종류)가 'suv'인 자동차와 'compact'인 자동차중
#    어떤 자동차의 cty(도시연비)가 더 높은지 분석할 것.

In [37]:
# 메모리 절약을 위해서 select를 잘 사용해야 한다.
mpg_suv <- mpg  %>% select(class, cty)  %>% filter(class =='suv')
mpg_suv_cty<- mean(mpg_suv$cty)
mpg_suv_cty # 13.5
cat('suv', mpg_suv_cty * 1.6, 'KM', '\n') # suv 20.8 KM

[1] 13.5

suv 21.6 KM

In [38]:
mpg_compact <- mpg  %>% select(class, cty)  %>% filter(class =='compact')
mpg_compact_cty <- mean(mpg_compact$cty)
mpg_compact_cty # 20.1276595744681
cat('compact', mpg_compact_cty * 1.6, 'KM', '\n') # compact 32.20426 KM

[1] 20.12766

compact 32.20426 KM

### arrange

In [40]:
# 수학점수 오름차순 정렬
exam  %>% arrange(math)  %>% head()

  id class math english science
1  9 3     20   98      15
2  5 2     25   80      65
3  4 1     30   98      58
4  3 1     45   86      78
5 12 3     45   85      32
6 13 4     46   98      65

In [9]:
# 수학점수 내림차순 정렬
exam  %>% arrange(desc(math))  %>% head()

  id class math english science
1  8 2     90   78      25
2 19 5     89   68      87
3  7 2     80   90      45
4 18 5     80   78      90
5 20 5     78   83      58
6 15 4     75   56      78

In [13]:
# 수학 점수 최상위 3명 출력
exam  %>% select(id, class, math) %>% arrange(desc(math))  %>% head(3)
# id	class	math
# 8	2	90
# 19	5	89
# 7	2	80

  id class math
1  8 2     90
2 19 5     89
3  7 2     80

In [14]:
# 수학 점수 마지막 3명 출력
exam  %>% select(id, class, math) %>% arrange(desc(math))  %>% tail(3)
# id	class	math
# 18	4	1	30
# 19	5	2	25
# 20	9	3	20

   id class math
18 4  1     30
19 5  2     25
20 9  3     20

In [7]:
# 2차 정렬: 학급 오름차순, 같은 학급 내에서 수학 내림차순
exam  %>%  arrange(class, desc(math))  %>% head()
# == arrange(exam, class, desc(math))

  id class math english science
1 2  1     60   97      60
2 1  1     50   98      50
3 3  1     45   86      78
4 4  1     30   98      58
5 8  2     90   78      25
6 7  2     80   90      45

In [ ]:
# 2. 'audi'에서 생산한 자동차중에 어떤 자동차 모델의
# hwy(고속도로 연비)가 높은지 알아보려고한다.
# 'audi'에서 생산한 자동차 중 hwy가 1 ~ 5위에 해당하는
# 자동차 데이터 출력 할 것.
# 변수는 manufacturer, model, hwy

In [13]:
mpg  %>% 
        select(manufacturer, model, hwy) %>% 
        filter(manufacturer == tolower('AUDI'))  %>% 
        arrange(desc(hwy))

   manufacturer model      hwy
1  audi         a4         31
2  audi         a4         30
3  audi         a4         29
4  audi         a4         29
5  audi         a4 quattro 28
6  audi         a4         27
7  audi         a4 quattro 27
8  audi         a4         26
9  audi         a4         26
10 audi         a4 quattro 26
11 audi         a4 quattro 25
12 audi         a4 quattro 25
13 audi         a4 quattro 25
14 audi         a4 quattro 25
15 audi         a4 quattro 25
16 audi         a6 quattro 25
17 audi         a6 quattro 24
18 audi         a6 quattro 23

In [12]:
# 모델별 평균 hwy를 내림차순으로 정렬
mpg  %>% 
        select(manufacturer, model, hwy) %>% 
        filter(manufacturer == tolower('AUDI'))  %>% 
        group_by(model) %>% summarize(mean_hwy = mean(hwy))  %>% arrange(desc(mean_hwy))

  model      mean_hwy
1 a4         28.28571
2 a4 quattro 25.75000
3 a6 quattro 24.00000

### mutate() : 변수 추가

In [14]:
exam <- read.csv("./files/exam.csv", fileEncoding='utf-8', encoding='utf-8')

In [15]:
exam  %>% head(3)

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60
3 3  1     45   86      78

In [20]:
# 총점 컬럼의 추가
exam2 <- exam %>% mutate(total = math + english + science)
exam2  %>% head(3)

  id class math english science total
1 1  1     50   98      50      198
2 2  1     60   97      60      217
3 3  1     45   86      78      209

In [23]:
# round,평균 컬럼의 추가
# 코드를 검증할 때는 할당하지 않고 진행한다.
exam2 <- exam2 %>% mutate(mean = round(total/3, digits=1))
exam2  %>% head(3)

  id class math english science total mean
1 1  1     50   98      50      198   66.0
2 2  1     60   97      60      217   72.3
3 3  1     45   86      78      209   69.7

In [26]:
# test 변수에 평균이 60점 이상이면 PASS 그렇지 않으면 FAIL 입력
exam2 <- exam2 %>% mutate(test=ifelse(mean >= 60, 'PASS', 'FAIL'))
exam2  %>% head(3)

  id class math english science total mean test
1 1  1     50   98      50      198   66.0 PASS
2 2  1     60   97      60      217   72.3 PASS
3 3  1     45   86      78      209   69.7 PASS

In [28]:
# 변수(칼럼)의 삭제, total, test 삭제
exam3 <- exam2 %>% select(-total, -test)
exam3  %>% head(3)

  id class math english science mean
1 1  1     50   98      50      66.0
2 2  1     60   97      60      72.3
3 3  1     45   86      78      69.7

In [31]:
# 평균 내림차순, desc 대신 - 사용
# exam3  %>% arrange(desc(mean))  %>% head(3)
exam3  %>% arrange(-mean)

  id class math english science mean
1 18 5     80   78      90      82.7
2 19 5     89   68      87      81.3
3  6 2     50   89      98      79.0

In [35]:
?row_number
# ranking {dplyr} : dplyr 안에 있음

In [39]:
# 순위 함수의 사용
x <- c(7, 1, 3, 3, 10, 5, 5)
row_number(x) # 동일한 순위를 다르게 처리
# 6 1 2 3 7 4 5
min_rank(x) # 동일한 순위는 동일한 값 적용, 2, 2, 다음에 4, ex. 반 석차
# 6 1 2 2 7 4 4
rank(x) # 값 이상하다
# 6 1 2.5 2.5 7 4.5 4.5
dense_rank(x) # 동일한 순위 동일값 적용, 2,2 다음에 3, 누락된 순위가 없음
# 4 1 2 2 5 3 3

[1] 6 1 2 3 7 4 5

[1] 6 1 2 2 7 4 4

[1] 6.0 1.0 2.5 2.5 7.0 4.5 4.5

[1] 4 1 2 2 5 3 3

In [42]:
exam3 <- exam3 %>% mutate(rank=dense_rank(-mean)) %>% arrange(rank)
exam3  %>% head(5)

  id class math english science mean rank
1 18 5     80   78      90      82.7 1
2 19 5     89   68      87      81.3 2
3  6 2     50   89      98      79.0 3
4 17 5     65   68      98      77.0 4
5 16 4     58   98      65      73.7 5

In [ ]:
# 3. mpg 데이터 복사본(mpg2)을 만들고,
#    cty와 hwy를 더한 '합산 연비 변수:total'를 추가 할 것.
#    최종 출력 변수는 manufacturer, cty, hwy, total

In [50]:
mpg2 <- mpg %>% select(manufacturer,cty, hwy) %>% mutate(total = cty + hwy)  
mpg2  %>% head(3)

  manufacturer cty hwy total
1 audi         18  29  47
2 audi         21  29  50
3 audi         20  31  51

In [52]:
# 4. total을 2로 나눠 '평균 연비 변수: mean'를 추가 할 것.
# 소수 첫째자리까지 출력, 단위는 갤런당 마일수
mpg2 <- mpg2 %>% mutate(mean=round(total/2, digits=1))
mpg2 %>% head()

  manufacturer cty hwy total mean
1 audi         18  29  47    23.5
2 audi         21  29  50    25.0
3 audi         20  31  51    25.5
4 audi         21  30  51    25.5
5 audi         16  26  42    21.0
6 audi         18  26  44    22.0

In [53]:
# 5. 1 마일 = 1.6KM임으로 KM로 변경하여 'km' 변수를 추가 할 것. 
mpg3 <- mpg2  %>%  mutate(km = round(mean*1.6))
mpg3  %>% head()

  manufacturer cty hwy total mean km
1 audi         18  29  47    23.5 38
2 audi         21  29  50    25.0 40
3 audi         20  31  51    25.5 41
4 audi         21  30  51    25.5 41
5 audi         16  26  42    21.0 34
6 audi         18  26  44    22.0 35

In [58]:
# 6. km변수를 리터 단윌 변경, 1갤런 3.78541 리터, liter 변수 추가
# 38km / 1갤런 -> 38km/3.78541리터 -> 10.../1리터
# 3리터로 가는 길을 1리터로 갔을 때 거리
mpg3 <- mpg3  %>%  mutate(liter = round(km / 3.78541, 1))
mpg3  %>% head()

  manufacturer cty hwy total mean km liter
1 audi         18  29  47    23.5 38 10.0
2 audi         21  29  50    25.0 40 10.6
3 audi         20  31  51    25.5 41 10.8
4 audi         21  30  51    25.5 41 10.8
5 audi         16  26  42    21.0 34  9.0
6 audi         18  26  44    22.0 35  9.2

In [59]:
# 7. 리터당 연비 내림차순으로 정렬할 것.
mpg3  %>% arrange(-liter)  %>% head()

  manufacturer cty hwy total mean km liter
1 volkswagen   35  44  79    39.5 63 16.6
2 volkswagen   33  44  77    38.5 62 16.4
3 volkswagen   29  41  70    35.0 56 14.8
4 toyota       28  37  65    32.5 52 13.7
5 honda        28  33  61    30.5 49 12.9
6 honda        25  36  61    30.5 49 12.9

In [63]:
# 8. 실습 3, 4, 5, 6을 통합한 스크립트를 제작하시오, mpg4 생성
mpg4 <- mpg %>% 
        select(manufacturer,cty, hwy) %>% 
        mutate(total = cty + hwy) %>% 
        mutate(mean = round(total/2, digits=1)) %>% 
        mutate(km = round(mean*1.6)) %>%
        mutate(liter = round(km / 3.78541, 1)) %>% 
        arrange(-liter)
mpg4  %>% head()

  manufacturer cty hwy total mean km liter
1 volkswagen   35  44  79    39.5 63 16.6
2 volkswagen   33  44  77    38.5 62 16.4
3 volkswagen   29  41  70    35.0 56 14.8
4 toyota       28  37  65    32.5 52 13.7
5 honda        28  33  61    30.5 49 12.9
6 honda        25  36  61    30.5 49 12.9

In [65]:
exam <- exam %>% rename('statistic' = 'math') # 바꿀 이름 = 원래 이름
exam  %>% head()

  id class statistic english science
1 1  1     50        98      50
2 2  1     60        97      60
3 3  1     45        86      78
4 4  1     30        98      58
5 5  2     25        80      65
6 6  2     50        89      98